---
kind: other
id: Methods.T:Autodesk.Revit.Creation.Application
source: html/fe85870b-7217-0c70-ba09-028a8e3fb6b6.htm
---
# Application Methods

Causes the object to release immediately any resources it may be utilizing.